# linux commands
# ~ - символ домашней диретории

# / - символ корневой директории

# . - обозначает текущую диреторию 

# .. - обозночает предыдущию директорию

# 1. ls - команда для вывода всех диреторий (папка) и файлов в текущей (рабочий ) директории в другую

# 2. cd (chanage directory) -  команда для перехода из одной директории в другую

# 3.mkdir - создает директории

# 4. touch - создает файл

# 5. rmdir - удаляет пустую директорию

# 6. rm - удаляет файл

#  
# 7. rm -rf - удаляет все папку и файлы

# 8. ls -a - показывает скрытые и обычные файлы и директории 

# 9. ls -la - показывает подробную информацию

# 10. pwd(print working directory) - выводит путь до текущей директории

# 11. cp - копирует файл или директорию в указанное место cp <название> <куда>
# 12. mv - команда для перемещения файла или директории, а также для переименования файла или директории,
#                переименование: mv john.txt jamie.txt
#                перемещение: mv john.txt directory
# 13. cat - показывает содержание файла
# 14. nano - открывает файл для редактирование в графическом интерфейсе Нано
#        * если нет файла, то нано создаст новый 
# 14. echo - команда для быстрой записи текста в файл 
#            echo текст > файл 


