# 1) Создайте переменную x и дайте ей любое числовое значение
# 1.1 Создайте переменную y и дайте ей любое числовое значение
# 1.2 Найдите сумму,произведение,вычитание чисел x,y  . Итоги запишите в другие переменные

# 2) Создайте переменную name и выведите 'name' 5 раз(Используя print 1 раз)

# 3) Создайте переменную phone, brand, year дайте им значения
# Вывод данных должен иметь такой вид:

# Модель телефона "phone" компании "brand" "year" года
 
x = 55
y = 36
z = x + y
a = x * y
b = x - y
print(z, a, b)

name = 'Zhanybek'
print(name * 5)
phone, brand, year  = 'iphone', 'apple', '2024-'
print(f'Модель телефона {phone} компании {brand} {year} года')

# +++++++++++++++++