# Напишите программу, которая находит полное число метров по заданному числу сантиметров.
sm = int(input('Введите сантиметр:'))
print(sm // 100)


# Формат входных данных
# На вход программе подаётся натуральное число – количество сантиметров.

# Формат выходных данных
# Программа должна вывести одно число – полное число метров.

# Sample Input 1:

# 345

# Sample Output 1:

# 3

# Sample Input 2:

# 100

# Sample Output 2:

# 1

# Sample Input 3:

# 89

# Sample Output 3:

# 0