# 1) Часы и минуты в секунды: Напишите функцию, которая принимает целочисленные значения часов и минут, конвертирует эти значения в секунды, а затем суммирует их и возвращает в качестве результата.

# def hour():
#     user1 = int(input('Enter your an hour: '))
#     user2 = int(input('Enter your a minute: '))
#     seconds = (user1  * 3600) + (user2 * 60)
#     return f'Hour: {user1}, Minute: {user2}, result: {seconds}'  
        
# print(hour()) 


# 2) Возраст в дни: Напишите функцию, которая принимает возраст (количество лет) и преобразует это значение в количество дней.

# def func():
#     age =int(input('Введите возраст: '))
#     year = age * 365
#     return year
# print(func())

# 3) Сколько ног на ферме: Для решения этой задачи необходимо написать функцию, которая посчитает количество ног у всех животных на ферме. На ферме живут курочки, коровки, и свинки. Зная количество животных каждого вида, посчитайте, сколько всего ног у всех животных на ферме.


# def infarm():
   
#     chicken = int(input('Введите колличество кур: '))
#     cow = int(input('Введите колличество коров: '))
#     pig = int(input('Введите колличество свиньи: '))
#     res = (chicken * 2) + (cow * 4) + (pig * 4)
#     return f'chickens feet: {chicken * 2}, cows feet: {cow * 4}, pigs feet: {pig * 4}, res: {res}'
# print(infarm())