# Git - распределения система контроля версий
# это система для отслеживания и ведения истории изменения файлов, в вашем проекте. При помощи распределенности в git еще и организовываеться командная работа.

# Репозиторий - это хранилище вашего кода и истории его изменений

# GitHub - веб сайт для размещения git-репозиториев в совместной разработке проектов

#------------------------------------------------------------------------------
# команды Git:
# 1. git init - она создает новый локальный репозиторий, в той директории в который была прописана команда. (Команда вводится один раз в начале)

# 2. git add - команда для добавления изменений в систему отслежевания гита 

# 3. git commit -m '<comment>' - команда для сохранения всех изменений в локальном репозитории с комментарием к ним
