# """
# 1) Напишите функцию -- чат-бот, который 
# Всегда отвечает “Конечно!” на любой вопрос
# Всегда отвечает “Успокойся”, если ты кричишь на него ВОТ ТАК!
# Всегда отвечает “Как классно, когда ты молчишь. Продолжай в том же духе!” Если вызвал функцию, но ничего не передал.
# В любых других случаях, отвечает “ну и что

# ”"""

# """
# 2) Напишите функцию, которая принимает слово и возвращает True, если слово изограмма (т.е. все буквы в слове уникальны). Иначе возвращает False
# """

# """
# 3) Подсчет букв:
# Напишите функцию, которая принимает строку и возвращает словарь, в котором ключами являются буквы, а значениями — количество их вхождений в строку. Регистр букв не должен учитываться.
# """


# """
# 4) Поиск подстроки:
# Напишите функцию, которая принимает две строки и возвращает True, если вторая строка является подстрокой первой.
# """

# """
# 5) Напишите функцию, которая проверяет, сколько раз каждое слово в переданной фразе было использовано. Например: “Money, money, money, it’s always sunny, in the richmen’s world”. money: 3, it’s: 1, always: 1, sunny: 1, in: 1, the: 1, richmen’s: 1, world: 1.
# """

# """
# 6) Напишите функцию, которая принимает строку и выводит количество гласных, согласных букв и остальных символов. Используйте только кириллические символы
# """

# """
# 7) Вам дан список из нескольких имён в нижнем регистре. Напишите функцию которая записывает начинает первую букву имени в верхнем регистре и сохраните в новом списке.
# """

# """
# 8) Вам дан список из целых чисел. Напишите функцию, в которой Вам необходимо найти факториал каждого из чисел и записать в новый список.
# """

# """
# 9) Вам дан список из чисел. Напишите функцию, которая вернёт новый список из квадратов этих чисел.
# """

# """

# 10) Напишите функцию average, которая принимает список чисел и возвращает их среднее значение, НЕ используя встроенные функции sum и len
# """